{
    "errors": {
        "erro.interno": "Ocorreu um erro interno no servidor. Por favor, tente novamente mais tarde.",
        "acesso.negado": "Acesso negado. Você não tem permissão para realizar esta ação.",
        "usuario.nao.encontrado": "Usuário não encontrado.",
        "usuario.nao.encontrado.id": "Usuário não encontrado com o ID fornecido.",
        "usuario.nao.encontrado.email": "Não existe usuário cadastrado com este email.",
        "email.ja.cadastrado": "Este email já está cadastrado. Por favor, use outro email ou faça login.",
        "cnh.obrigatoria": "É necessário informar os dados da CNH para se cadastrar como motorista.",
        "carro.obrigatorio": "É necessário informar os dados do veículo para se cadastrar como motorista.",
        "senha.formato.invalido": "O formato da senha é inválido. A senha deve conter pelo menos 6 caracteres.",
        "status.ja_revisado": "Este cadastro já foi revisado e não pode ser alterado.",
        "status.invalido": "O status de cadastro fornecido é inválido.",
        "usuario.cadastro.nao_aprovado": "Seu cadastro ainda não foi aprovado. Por favor, aguarde a aprovação para acessar esta funcionalidade.",
        "usuario.nao_autenticado": "Você precisa estar autenticado para acessar este recurso.",
        "usuario.administrador.nao_pode_acessar_recurso": "Administradores não podem acessar este recurso.",
        "usuario.estudante.matricula.ja_cadastrada": "Esta matrícula já está cadastrada no sistema.",
        "usuario.estudante.nao_encontrado": "Estudante não encontrado.",
        "usuario.estudante.nao_pode_acessar_recurso": "Estudantes não podem acessar este recurso.",
        "usuario.estudante.motorista.ja_e_motorista": "Este estudante já está cadastrado como motorista.",
        "usuario.estudante.motorista.cnh_ja_cadastrada": "Esta CNH já está cadastrada no sistema.",
        "usuario.estudante.motorista.nao_e_motorista": "Este estudante não está cadastrado como motorista.",
        "carona.nao.encontrada": "Carona não encontrada.",
        "carona.concluida_cancelada": "Esta carona já foi concluída ou cancelada.",
        "carona.ja.iniciada": "Esta carona já foi iniciada e não pode ser modificada.",
        "carona.nao.planejada": "Esta carona não está no status planejada.",
        "carona.vagas.insuficientes": "Não há vagas suficientes para esta carona.",
        "carona.sem.vagas": "Esta carona não possui mais vagas disponíveis.",
        "carona.estudante.ja.passageiro": "Você já é passageiro desta carona.",
        "carona.motorista.como.passageiro": "O motorista não pode ser passageiro da própria carona.",
        "carona.data.partida.invalida": "A data de partida informada é inválida.",
        "carona.data.chegada.invalida": "A data de chegada informada é inválida.",
        "carona.data.chegada.anterior_partida": "A data de chegada não pode ser anterior à data de partida.",
        "carona.data.deve_informar_partida_ou_chegada": "É necessário informar pelo menos a data de partida ou de chegada.",
        "carona.nao_pertence_motorista": "Esta carona não pertence ao motorista informado.",
        "carona.alteracao_status_invalida": "A alteração de status solicitada é inválida para esta carona.",
        "carona.nao_permite_adicionar_passageiro": "Esta carona não permite adicionar novos passageiros no momento.",
        "carona.trajeto.nao_encontrado": "Trajeto não encontrado.",
        "login.invalido": "Email ou senha incorretos. Por favor, verifique suas credenciais.",
        "token.invalido": "Token de autenticação inválido. Por favor, faça login novamente.",
        "token.expirado": "Sua sessão expirou. Por favor, faça login novamente.",
        "internal auth error": "Erro interno de autenticação. Por favor, tente novamente.",
        "campo.obrigatorio": "Existem campos obrigatórios não preenchidos.",
        "email.invalido": "O email informado é inválido.",
        "senha.tamanho.invalido": "A senha deve ter entre 6 e 20 caracteres.",
        "nome.tamanho.invalido": "O nome deve ter entre 3 e 100 caracteres.",
        "requisicao.invalida": "A requisição enviada é inválida.",
        "comum.parametro.invalido": "Um ou mais parâmetros informados são inválidos.",
        "comum.parametro.faltante": "Um ou mais parâmetros obrigatórios não foram informados.",
        "comum.cliente.entidade_nao_encontrada": "A entidade solicitada não foi encontrada.",
        "arquivo.invalido": "O arquivo enviado é inválido.",
        "arquivo.vazio": "O arquivo enviado está vazio.",
        "arquivo.formato.invalido": "O formato do arquivo é inválido. Por favor, use um formato suportado.",
        "arquivo.muito.grande": "O arquivo é muito grande. O tamanho máximo permitido é 5MB.",
        "arquivo.imagem.corrompida": "A imagem enviada está corrompida ou não pode ser processada.",
        "arquivo.erro.leitura": "Ocorreu um erro ao ler o arquivo. Por favor, tente novamente.",
        "arquivo.imagem.proporcao.invalida": "A proporção da imagem é inválida. Por favor, use uma imagem quadrada.",
        "arquivo.imagem.muito.pequena": "A imagem é muito pequena. O tamanho mínimo é 100x100 pixels.",
        "arquivo.imagem.muito.grande": "A imagem é muito grande. O tamanho máximo é 2000x2000 pixels.",
        "arquivo.erro.upload": "Ocorreu um erro ao fazer upload do arquivo. Por favor, tente novamente.",
        "arquivo.erro.atualizacao": "Ocorreu um erro ao atualizar o arquivo. Por favor, tente novamente."
    },
    "statusCodes": {
        "400": "Requisição inválida. Verifique os dados enviados.",
        "401": "Não autorizado. Por favor, faça login novamente.",
        "403": "Acesso negado. Você não tem permissão para esta ação.",
        "404": "Recurso não encontrado.",
        "422": "Dados inválidos. Verifique as informações enviadas.",
        "429": "Muitas requisições. Por favor, aguarde um momento e tente novamente.",
        "500": "Erro interno do servidor. Tente novamente mais tarde.",
        "503": "Serviço indisponível. Por favor, tente novamente mais tarde."
    },
    "networkErrors": {
        "timeout": "O servidor demorou muito para responder. Tente novamente.",
        "network": "Erro de conexão. Verifique sua internet e tente novamente.",
        "connection": "Sem conexão com a internet. Verifique sua rede e tente novamente."
    }
}